In [1]:
import re

In [ ]:
re.Pattern # шаблон
re.Match # то, что нашлось по шаблону

In [26]:
pattern = re.compile(r'(Перикл)(\w*)')

In [42]:
text = '''Перикл (др.-греч. Περικλῆς, от περί + κλέος, — «окружённый славой»; примерно 494/493—429 годы до н. э.) — древнегреческий государственный деятель, один из «отцов-основателей» афинской демократии, знаменитый оратор и полководец. Принадлежал к древней аттической аристократии, был сыном видного политика Ксантиппа из рода Бузигов и Агаристы из рода Алкмеонидов.

Первое упоминание о Перикле в сохранившихся источниках относится к 473/472 году до н. э., начало политической карьеры — к 460-м годам до н. э. Вначале Перикл принадлежал к аристократической «партии», позже, несмотря на своё происхождение, перешёл на сторону демократов. Совместно с Эфиальтом он добился изгнания Кимона, ограничил полномочия аристократического органа власти — Ареопага. После гибели Эфиальта в 461 году до н. э. Перикл возглавил демократическую «партию». Он активно участвовал в Малой Пелопоннесской войне 460—445 годов до н. э. со Спартой и её союзниками, причём в начале войны находился на второстепенных ролях, но под конец стал наиболее влиятельным политиком Афин. Своими реформами Перикл обеспечил доступ к государственным должностям для бедных граждан, ограничил влияние родовой знати, сделал более регулярной работу Народного собрания. Всё это означало продолжение демократизации Афин. Перикл инициировал масштабное строительство, благодаря которому на Афинском Акрополе появились Парфенон, Пропилеи, статуя Афины Промахос.'''

In [10]:
m = re.search(r'(Перикл)(\w*)', text)

In [6]:
m

In [12]:
m.group()

''

In [13]:
m.start()

0

In [14]:
m.end()

6

In [15]:
m.span()

(0, 6)

In [22]:
re.findall(pattern, text)

['Перикл', 'Перикле', 'Перикл', 'Перикл', 'Перикл', 'Перикл']

In [27]:
for match in re.finditer(pattern, text):
    if match.group(2):
        print(match.group(2))

е

In [ ]:
re.match()
re.fullmatch()

In [35]:
text = '87563shfhfkdsj'
res = re.match(r'[0-9]+', text)

In [36]:
if res:
    print('My string begins with numbers')
else:
    print('No numbers')

My string begins with numbers

In [39]:
text = '12-34-566'
pattern = r'\d\d-\d\d-\d\d'

In [40]:
re.fullmatch(pattern, text)

In [ ]:
def uppercase(match): -> str
    return match.group().upper() 

re.sub(r'ерикл\w*', uppercase, text)

re.sub(r'Перикл\w*', lambda match: match.group().upper(), text)

In [ ]:
re.split(pattern, text)

In [50]:
d = None
bool(d)

False

In [ ]:
pip install pandas

In [51]:
import pandas as pd

In [ ]:
pd.DataFrame()
pd.Series()

In [54]:
data1 = pd.DataFrame([[1, 2, 3], [4, 5, 6]])

In [53]:
data

   0  1  2
0  1  2  3
1  4  5  6

In [55]:
data2 = pd.DataFrame({'col1': [1, 2, 3], 'col2': [4, 5, 6]})

In [56]:
data2

   col1  col2
0     1     4
1     2     5
2     3     6

In [57]:
data3 = pd.DataFrame({'r1': {'l1': 1, 'l2': 2}, 'r2': {'l1': 3, 'l2': 4}})

In [58]:
data3

    r1  r2
l1   1   3
l2   2   4

In [ ]:
pip install openpyxl

In [ ]:
data = pd.read_excel(path)  # .xlsx

In [59]:
titanic = pd.read_csv('titanic.csv')

In [61]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [63]:
titanic.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [64]:
titanic.tail(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [65]:
titanic.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
623,624,0,3,"Hansen, Mr. Henry Damsgaard",male,21.0,0,0,350029,7.8542,NaN,S

In [66]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

In [67]:
data3.index

Index(['l1', 'l2'], dtype='object')

In [68]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [69]:
titanic.loc[23]

PassengerId                              24
Survived                                  1
Pclass                                    1
Name           Sloper, Mr. William Thompson
Sex                                    male
Age                                    28.0
SibSp                                     0
Parch                                     0
Ticket                               113788
Fare                                   35.5
Cabin                                    A6
Embarked                                  S
Name: 23, dtype: object

In [70]:
data3.loc['l1']

r1    1
r2    3
Name: l1, dtype: int64

In [73]:
titanic.iloc[23, 3]

'Sloper, Mr. William Thompson'

In [74]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [75]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [76]:
titanic['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [77]:
titanic.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [78]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [80]:
len(titanic[titanic['Survived'] == 1])

342

In [81]:
len(titanic[(titanic['Survived'] == 1) & (titanic.Sex == 'male')])

109

In [82]:
titanic.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [83]:
titanic.Age.mean()

29.69911764705882

In [84]:
titanic.Survived.sum()

342

In [89]:
len(set(titanic.Survived))

{0, 1}

In [90]:
titanic.dropna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [91]:
len(titanic)

891

In [94]:
titanic.drop('Parch', axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q

In [ ]:
titanic.drop_duplicates(keep='first')

In [95]:
titanic['Sex'] = titanic['Sex'].apply(lambda x: 0 if x == 'male' else 1)

In [96]:
titanic.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
748,749,0,1,"Marvin, Mr. Daniel Warner",0,19.0,1,0,113773,53.1,D30,S

In [97]:
titanic.groupby('Survived').mean()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare
Survived,,,,,,,
0,447.016393,2.531876,0.147541,30.626179,0.553734,0.329690,22.117887
1,444.368421,1.950292,0.681287,28.343690,0.473684,0.464912,48.395408